---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LocationCurve
source: html/1ab22803-5ca8-2a1a-73c5-c63fd01c92ef.htm
---
# LocationCurve Members

Causes the object to release immediately any resources it may be utilizing.